In [1]:
import pandas as pd

### 'read_csv' to read a file

In [2]:
data2show = pd.read_csv('bhos.csv') # read_csv read a file

In [8]:
data2show

   Unnamed: 0     name  marks        city
0           0  Gauurav     47  jamshedpur
1           1    Rohan     67     bithoor
2           2    Jeetu     83     pulgaon
3           3    Bittu     91   jagdalpur

### FILTERING

In [4]:
#column Filtering
dat = data2show[['name','marks']]
dat

      name  marks
0  Gauurav     47
1    Rohan     67
2    Jeetu     83
3    Bittu     91

In [9]:
# rows filtering
## select rows using index
datsun = data2show[0:2]
datsun

   Unnamed: 0     name  marks        city
0           0  Gauurav     47  jamshedpur
1           1    Rohan     67     bithoor

In [ ]:
#boolean filtering

### 'to_csv' to create a file

In [ ]:
data2edit= pd.read_csv('bross1.csv')

In [ ]:
data2edit.to_csv('bross2.csv', index = False) #to_csv create a file

In [ ]:
data2edit.describe()

In [ ]:
data2edit.index=['zero','first','second','third']

In [ ]:
data2edit.columns=['','id','Name','Emp_Id','City']

In [ ]:
data2edit

#### Creating a Series

In [ ]:
sr = {'name':'Dipesh','Age':24,'City':'Durg'};
data = pd.Series(sr)
data

##### >> Copy a Series

In [ ]:
newData = data.copy()
newData['City'] = 'Bhilai'
newData

In [ ]:
newData['name']

In [ ]:
arrays = pd.Series(['D','I','P','E','S','H','+','M','A','T','E'])
arrays[:3]

In [ ]:
jj = arrays[8]
jj

##### >>>> indexing & selecting a data in the form of series from a datasets.

In [ ]:
justDf = pd.read_csv('bross1.csv')
sr = pd.Series(justDf['2'])
sr

In [ ]:
db = sr.copy()
db['7'] = 'chintu'
db

In [ ]:
data = {'col1': [1, 2, 3], 'col2': [4, 5, 6]}
index = ['a', 'b', 'c']
df = pd.DataFrame(data, index=index)
print(data)
    # Select row 'a' and all columns
print(df.loc['a'])
    
    # Select rows 'a' and 'b', and column 'col2'
print(df.loc[['a', 'b'], 'col2'])
    
    # Select rows from 'a' to 'c', and columns from 'col1' to 'col2'
print(df.loc['a':'c', 'col1':'col2'])

In [ ]:
newData = pd.DataFrame()

In [ ]:
# string handling